Autodesk.Revit.UI.ProjectParamsDlgUtils.DisplayProjectParametersDialog(Autodesk.Revit.DB.Document)
Method to display the project parameters dialog
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ProjectParamsDlgUtils
Utils class that enables the display of the project parameters dialog from the addin
Since:
2027